libhal/SJSU-Dev2/demos/stm32f10x/canbus/source/main.cpp
  ////////////////////////////////////////
  //////// Filter Registers     //////////
  ////////////////////////////////////////
  
  /// CAN Filter Master Register
  struct FilterMaster
  {
    static constexpr bit::Mask kInitializationMode            = bit::MaskFromRange(0);
    static constexpr bit::Mask kCan2StartBank                 = bit::MaskFromRange(8, 13);
  };

  /// CAN Filter Bank Mode
   enum class FilterBankMode : int
  {
    kActive                        = 0,
    kInitialization                = 1
  };

  /// CAN Filter Mode Register (CAN_FM1R)
  enum class FilterMode : int
  {
    kMaskMode                      =0,
    kListMode                      =1
  };

  /// CAN Filter Scale Register (CAN_FS1R)
  enum class FilterScale : int
  {
    kDual16BitScale                =0,
    kSingle32BitScale              =1
  };

    /// CAN Filter Activation Register (CAN_FFA1R)
   enum class  FilterActivation  : int
  {
    kNotActive                      =0,
    kActive                         =1
  };

  struct Filter
  {
    static constexpr bit::Mask k0                      = bit::MaskFromRange(0);
    static constexpr bit::Mask k1                      = bit::MaskFromRange(1);
    static constexpr bit::Mask k2                      = bit::MaskFromRange(2);
    static constexpr bit::Mask k3                      = bit::MaskFromRange(3);
    static constexpr bit::Mask k4                      = bit::MaskFromRange(4);
    static constexpr bit::Mask k5                      = bit::MaskFromRange(5);
    static constexpr bit::Mask k6                      = bit::MaskFromRange(6);
    static constexpr bit::Mask k7                      = bit::MaskFromRange(7);
    static constexpr bit::Mask k8                      = bit::MaskFromRange(8);
    static constexpr bit::Mask k9                      = bit::MaskFromRange(9);
    static constexpr bit::Mask k10                     = bit::MaskFromRange(10);
    static constexpr bit::Mask k11                     = bit::MaskFromRange(11);
    static constexpr bit::Mask k12                     = bit::MaskFromRange(12);
    static constexpr bit::Mask k13                     = bit::MaskFromRange(13);
    static constexpr bit::Mask k14                     = bit::MaskFromRange(14);
    static constexpr bit::Mask k15                     = bit::MaskFromRange(15);
    static constexpr bit::Mask k16                     = bit::MaskFromRange(16);
    static constexpr bit::Mask k17                     = bit::MaskFromRange(17);
    static constexpr bit::Mask k18                     = bit::MaskFromRange(18);
    static constexpr bit::Mask k19                     = bit::MaskFromRange(19);
    static constexpr bit::Mask k20                     = bit::MaskFromRange(20);
    static constexpr bit::Mask k21                     = bit::MaskFromRange(21);
    static constexpr bit::Mask k22                     = bit::MaskFromRange(22);
    static constexpr bit::Mask k23                     = bit::MaskFromRange(23);
    static constexpr bit::Mask k24                     = bit::MaskFromRange(24);
    static constexpr bit::Mask k25                     = bit::MaskFromRange(25);
    static constexpr bit::Mask k26                     = bit::MaskFromRange(26);
    static constexpr bit::Mask k27                     = bit::MaskFromRange(27);
  };





  /// CANBUS Mailbox Register
  struct MailboxIdentifier
  {
    static constexpr bit::Mask kTransmitMailboxRequest        = bit::MaskFromRange(0);
    static constexpr bit::Mask kRemoteTransmissionRequest     = bit::MaskFromRange(1);
    static constexpr bit::Mask kIdentifierExtension           = bit::MaskFromRange(2);
    static constexpr bit::Mask kStandardId                    = bit::MaskFromRange(21, 31);
    static constexpr bit::Mask kExtenedId                     = bit::MaskFromRange(3, 31);
  };


  /// https://www.nxp.com/docs/en/user-guide/UM10562.pdf (pg. 554)
  enum class Commands : uint32_t
  {

  };

  /// https://www.nxp.com/docs/en/user-guide/UM10562.pdf (pg. 560)
  /// CAN frame format: https://goo.gl/images/XLjzn5
  enum FrameErrorCodes : uint8_t
  {

  };

  /// Frame Error container with error codes and error messages.
  struct FrameError_t
  {

  };

  /// Lookup table with all of the CANBUS FrameErrors.
  static constexpr std::array<FrameError_t, 19> kFrameErrorTable = {
  };

  /// Contains all of the information for to control and configure a CANBUS bus
  /// on the STM32F10x platform.
  struct Port_t  // NOLINT
  {
     /// Reference to transmit pin object
    sjsu::Pin & td_pin;

    /// Pin function code for transmit
    uint8_t td_function_code;

    /// Reference to read pin object
    sjsu::Pin & rd_pin;

    /// Pin function code for receive
    uint8_t rd_function_code;

    PinSettings_t::Resistor rd_resistor_state;

    /// Pointer to the STM32F1 CAN peripheral in memory
    CAN_TypeDef * can;

    /// Peripheral's ID
    sjsu::SystemController::ResourceID id;
  };

 /// Container for the STM32F10x CANBUS registers
  struct StmDataRegisters_t
  {
    /// TFI register contents
    uint32_t frame = 0;
    /// TID register contents
    uint32_t id = 0;
    /// TDA register contents
    uint32_t data_a = 0;
    /// TDB register contents
    uint32_t data_b = 0;
  };

 

  /// Pointer to the LPC CANBUS acceptance filter peripheral in memory
  // inline static LPC_CANAF_TypeDef * can_acceptance_filter_register = LPC_CANAF;

  /// @param channel - Which CANBUS channel to use
  explicit constexpr Can(const Port_t & channel) : channel_(channel) {}

  void ModuleInitialize() override
  {
    sjsu::LogInfo("Power on CANBUS peripheral");

    /// Power on CANBUS peripheral=
    auto & platform = sjsu::SystemController::GetPlatformController();
    platform.PowerUpPeripheral(channel_.id); // checked

    /// Configure pins
  
    // Setup TX as output with alternative control (TXD)
    channel_.td_pin.settings.function = 1;
    channel_.td_pin.settings.Floating();

    // Setup RX as Input with Pullup
    channel_.rd_pin.settings.function = 2; // Input Floating
    channel_.rd_pin.settings.PullUp();
    // GPIOA->CRH = 0x888b8444
    // GPIOA->ODR = 0xa800
    channel_.td_pin.Initialize();
    channel_.rd_pin.Initialize();

   
	

  // static constexpr bit::Mask kInitializationRequest           = bit::MaskFromRange(0);
  // static constexpr bit::Mask kSleepModeRequest                = bit::MaskFromRange(1);
  // static constexpr bit::Mask kTransimtFIFOPriority            = bit::MaskFromRange(2);
  // static constexpr bit::Mask kRecieveFIFOPriority             = bit::MaskFromRange(3);
  // static constexpr bit::Mask kNoAutomaticRetransmission       = bit::MaskFromRange(4);
  // static constexpr bit::Mask kAutomaticWakeupMode             = bit::MaskFromRange(5);
  // static constexpr bit::Mask kAutomaticBussOffManagement      = bit::MaskFromRange(6);
  // static constexpr bit::Mask kTimeTriggeredCommunicationMode  = bit::MaskFromRange(7);
  // static constexpr bit::Mask kCanMasterReset                  = bit::MaskFromRange(15);
  // static constexpr bit::Mask kDebugFreeze                     = bit::MaskFromRange(16);

    // Enter Initalization mode in order to write to CAN registers.
    channel_.can->MCR =
        bit::Insert(channel_.can->MCR, false, Mode::kSleepModeRequest); //0
    channel_.can->MCR =
        bit::Insert(channel_.can->MCR, true, Mode::kInitializationRequest); //0
    channel_.can->MCR =
        bit::Insert(channel_.can->MCR, true, Mode::kNoAutomaticRetransmission); // 4	
    channel_.can->MCR =
        bit::Insert(channel_.can->MCR, true, Mode::kAutomaticBussOffManagement); // 6
    // CAN1->MCR = 0x10051

    // SetMode(Mode::kInitializationRequest, true);
    // SetMode(Mode::kNoAutomaticRetransmission, true);
    // SetMode(Mode::kAutomaticBussOffManagement, true);
    // Wait to enter Initialization mode
    while (!VerifyStatus(MasterStatus::kInitializationAcknowledge, true)){}

