libhal/SJSU-Dev2/demos/stm32f10x/canbus/source/main.cpp
    ConfigureBaudRate();
    // ConfigureReceiveHandler();

    EnableAcceptanceFilter();

    // Leave Initialization mode
    SetMode(Mode::kInitializationRequest, false);
    // Wait to leave Initialization mode
    while (!VerifyStatus(MasterStatus::kInitializationAcknowledge, false)){}
    return;
  }

  void Send(const Message_t & message)
  {
    StmDataRegisters_t registers = ConvertMessageToRegisters(message);
    // sjsu::LogInfo(" CAN1->sTxMailBox[0].TIR | %#x", CAN1->sTxMailBox[0].TIR);
    // sjsu::LogInfo(" CAN1->sTxMailBox[0].TDTR | %#x", CAN1->sTxMailBox[0].TDTR);
    // sjsu::LogInfo(" CAN1->sTxMailBox[0].TSR | %#x\n", CAN1->TSR);
    bool sent = false;
    while (!sent)
    {
      uint32_t status_register = channel_.can->TSR;
      // Check if any buffer is available.
      if (bit::Read(status_register, TransmitStatus::kTransmitMailbox0Empty))
      {
        sjsu::LogInfo(" Sent Mailbox 1");
        channel_.can->sTxMailBox[0].TDTR &= ~(0xF);
	      channel_.can->sTxMailBox[0].TDTR |= message.length & 0xF;
        // channel_.can->sTxMailBox[0].TDTR = registers.frame;
        channel_.can->sTxMailBox[0].TDLR = registers.data_a;
        channel_.can->sTxMailBox[0].TDHR = registers.data_b;
        sjsu::LogInfo("registers.id | %#x\n", registers.id);
        channel_.can->sTxMailBox[0].TIR = registers.id;
        sjsu::LogInfo("channel_.can->sTxMailBox[0].TIR | %#x\n", channel_.can->sTxMailBox[0].TIR);
        sent = true;
      }
      else if (bit::Read(status_register, TransmitStatus::kTransmitMailbox1Empty))
      {
        sjsu::LogInfo(" Sent Mailbox 2");
        channel_.can->sTxMailBox[1].TDTR &= ~(0xF);
	      channel_.can->sTxMailBox[1].TDTR |= message.length & 0xF;
        // channel_.can->sTxMailBox[1].TDTR = registers.frame;
        channel_.can->sTxMailBox[1].TDLR = registers.data_a;
        channel_.can->sTxMailBox[1].TDHR = registers.data_b;
        channel_.can->sTxMailBox[1].TIR = registers.id;
        sent = true;
      }
      else if (bit::Read(status_register, TransmitStatus::kTransmitMailbox2Empty))
      {
        sjsu::LogInfo(" Sent Mailbox 3");
        channel_.can->sTxMailBox[2].TDTR &= ~(0xF);
	      channel_.can->sTxMailBox[2].TDTR |= message.length & 0xF;
        channel_.can->sTxMailBox[2].TDLR = registers.data_a;
        channel_.can->sTxMailBox[2].TDHR = registers.data_b;
        channel_.can->sTxMailBox[2].TIR = registers.id;
        sent = true;
      }
    }
  }

  bool HasData()
  {
    uint32_t fifo0_status = channel_.can->RF0R;
    uint32_t fifo1_status = channel_.can->RF1R;
    if (bit::Read(fifo0_status, FIFOStatus::kMessagesPending))
    {
      return true;
    }
    if(bit::Read(fifo1_status, FIFOStatus::kMessagesPending))
    {
      return true;
    }
    return false;
  }
  
  Message_t Receive()
  {
    Message_t message;

    uint32_t fifo0_status = channel_.can->RF0R;
    uint32_t fifo1_status = channel_.can->RF1R;
    FIFOSelect fifo_select = FIFOSelect::kFIFONone;

    if (bit::Read(fifo0_status, FIFOStatus::kMessagesPending))
    {
      fifo_select = FIFOSelect::kFIFO1;
    }
    else if(bit::Read(fifo1_status, FIFOStatus::kMessagesPending))
    {
      fifo_select = FIFOSelect::kFIFO2;
    }
    // else
    // {
    //   // Error, tried to recieve when there were no pending messages.
    //   return;
    // }

    uint32_t frame = channel_.can->sFIFOMailBox[Value(fifo_select)].RDTR;
    uint32_t id = channel_.can->sFIFOMailBox[Value(fifo_select)].RIR;

    // Extract all of the information from the message frame
    bool is_remote_request = bit::Extract(id,     FrameIdentifier::kRemoteRequest);
    uint32_t length        = bit::Extract(frame,  FrameLengthAndInfo::kDataLengthCode);
    uint32_t format        = bit::Extract(id,     FrameIdentifier::kIdentifierType);

    message.is_remote_request = is_remote_request;
    message.length            = static_cast<uint8_t>(length);
    message.format            = static_cast<Message_t::Format>(format);

    // Get the frame ID
    if (message.format == Message_t::Format::kExtended)
    {
      message.id = bit::Extract(id, FrameIdentifier::kExtendedIdentifier);
    }
    else
    {
      message.id = bit::Extract(id, FrameIdentifier::kStandardIdentifier);
    }
    sjsu::LogInfo("Raw recieved ID | %d\n Pending messages | %d", 
      (CAN1->sFIFOMailBox[0].RIR >> 21) & 0x7FF,
      (CAN1->RF0R& 0x3));
    

    // Pull the bytes from RDL into the payload array
    message.payload[0] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDLR >> (0 * 8)) & 0xFF;
    message.payload[1] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDLR >> (1 * 8)) & 0xFF;
    message.payload[2] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDLR >> (2 * 8)) & 0xFF;
    message.payload[3] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDLR >> (3 * 8)) & 0xFF;

    // Pull the bytes from RDH into the payload array
    message.payload[4] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDHR >> (0 * 8)) & 0xFF;
    message.payload[5] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDHR >> (1 * 8)) & 0xFF;
    message.payload[6] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDHR >> (2 * 8)) & 0xFF;
    message.payload[7] = (channel_.can->sFIFOMailBox[Value(fifo_select)].RDHR >> (3 * 8)) & 0xFF;

    // Release the RX buffer and allow another buffer to be read.
    if (fifo_select == FIFOSelect::kFIFO1)
    {
      // channel_.can->RF0R = bit::Set(channel_.can->RF0R, FIFOStatus::kReleaseOutputMailbox);
      CAN1->RF0R |= 0x20;
    }
    else if (fifo_select == FIFOSelect::kFIFO2)
    {
      channel_.can->RF1R = bit::Set(channel_.can->RF1R, FIFOStatus::kReleaseOutputMailbox);
    }

    return message;
  }

  bool SelfTest(uint32_t id)
  {
    Message_t test_message;
    test_message.id = id;
    test_message.payload[0] = 0x88;
    test_message.payload[1] = 0x99;
    test_message.payload[2] = 0xAA;
    test_message.payload[3] = 0xBB;
    test_message.payload[4] = 0xBB;
    test_message.payload[5] = 0xCC;
    test_message.payload[6] = 0xDD;
    test_message.payload[7] = 0xFF;
    Send(test_message);

      //  Send(const Message_t & message)

    // Enable reset mode in order to write to registers
    channel_.can->MCR =
        bit::Insert(channel_.can->MCR, true, Mode::kInitializationRequest); //0
    // SetMode(Mode::kInitializationRequest, true);
    // Enable self-test mode
    channel_.can->BTR =
        bit::Insert(channel_.can->BTR, true, BusTiming::kLoopBackMode);
    // SetLoopback(true);
    // Disable reset mode
    channel_.can->MCR =
        bit::Insert(channel_.can->MCR, false, Mode::kInitializationRequest); //0
    // SetMode(Mode::kInitializationRequest, false);

    // Write test message to tx buffer 1
    StmDataRegisters_t registers = ConvertMessageToRegisters(test_message);

    // Set self-test request and send buffer 1
    
    // while (true)
    // {
    //    uint32_t status_register = channel_.can->TSR;
    //   // Check if any buffer is available.
    //   if (bit::Read(status_register, TransmitStatus::kTransmitMailbox0Empty))
    //   {
    //     channel_.can->sTxMailBox[0].TDTR = registers.frame;
    //     channel_.can->sTxMailBox[0].TDLR = 0xAAAA;
    //     channel_.can->sTxMailBox[0].TDHR = 0xBBBB;
    //     channel_.can->sTxMailBox[0].TIR  = registers.id;
    //     break;
    //   }
    // }

