libhal/SJSU-Dev2/demos/stm32f10x/canbus/source/main.cpp
    // Allow time for RX to fire
    Wait(100ms, [this]() { return HasData(); });

    // Read the message from the rx buffer and enqueue it into the rx queue.
    auto received_message = Receive();

    // const uint32_t kExpectedDataA =
    //     received_message.payload[0] | received_message.payload[1] << 8 |
    //     received_message.payload[2] << 16 | received_message.payload[3] << 24;
    // const uint32_t kExpectedDataB = 
    //     received_message.payload[4] | received_message.payload[5] << 8 |
    //     received_message.payload[6] << 16 | received_message.payload[7] << 24;

    sjsu::LogInfo("%#04x %#04x %#04x %#04x %#04x %#04x %#04x %#04x\n",
          received_message.payload[0],
          received_message.payload[1],
          received_message.payload[2],
          received_message.payload[3],
          received_message.payload[4],
          received_message.payload[5],
          received_message.payload[6],
          received_message.payload[7]);

    // Check if the received message matches the one we sent
    if (received_message.id != test_message.id)
    {
      return false;
    }

    // Disable self-test mode
    SetMode(Mode::kInitializationRequest, true);
    SetLoopback(false);
    SetMode(Mode::kInitializationRequest, false);

    return true;
  }

  bool IsBusOff() override
  {}
  ~Can(){}


 private:
  void ConfigureBaudRate()
  {
    // constexpr int kTseg1               = 0;
    // constexpr int kTseg2               = 0;
    // constexpr int kSyncJump            = 0;
    // constexpr uint32_t kBaudRateAdjust = kTseg1 + kTseg2 + kSyncJump + 3;

    auto & system         = sjsu::SystemController::GetPlatformController();
    const auto kFrequency = system.GetClockRate(channel_.id);

    // Must be between 8 - 25 time Quanta

    // Clock    = 10 Mhz
    // Tq       = 1/10Mhz = 100 ns
    // bit rate = 100 Khz
    // bit time = 1/100Khz = 10 us
    // # of tq = bit time / tq = 10000 ns  / 100 ns = 100 
    // Tsync = 1
    // TSync + TSeg1 / TSync + TSeg1 + TSeg2 = 80%
    // 1 + Tseg / 100 = 80% so TSeg1 = 79 TSeg2 = 21 

    // uint32_t prescaler = ((kFrequency / settings.baud_rate) - 1);

    // uint32_t prescaler =
    // uint32_t tq = (Prescaler + 1) * (1 / kFrequency); // Length of time quanta

          // enum BITRATE{CAN_50KBPS,
          //              CAN_100KBPS,
          //              CAN_125KBPS,
          //              CAN_250KBPS,
          //              CAN_500KBPS,
          //              CAN_1000KBPS};

          // CAN_bit_timing_t CAN_bit_timing[6] = 
          // {{2, 13, 45}, 
          //  {2, 15, 20}, 
          //  {2, 13, 18}, 
          //  {2, 13, 9}, 
          //  {2, 15, 4}, 
          //  {2, 15, 2}};
      channel_.can->BTR =
        bit::Insert(channel_.can->BTR, 1, BusTiming::kPrescalar);
      channel_.can->BTR =
        bit::Insert(channel_.can->BTR, 14, BusTiming::kTimeSegment1);
      channel_.can->BTR =
        bit::Insert(channel_.can->BTR, 1, BusTiming::kTimeSegment2);
      channel_.can->BTR =
        bit::Insert(channel_.can->BTR, 1, BusTiming::kLoopBackMode);
    

    // sjsu::LogDebug(
    //     "freq = %f :: prescale = %lu", kFrequency.to<double>(), prescaler);
  }
  void ConfigureReceiveHandler(){}
  StmDataRegisters_t ConvertMessageToRegisters(const Message_t & message) const
  {
    StmDataRegisters_t registers;

    uint32_t frame_info =
        bit::Value(frame_info)
            // .Insert(message.uptime, FrameLengthAndInfo::kMessageTimeStamp)
            .Insert(message.length, FrameLengthAndInfo::kDataLengthCode);

    uint32_t frame_id = 0;
   
    if(message.format == Message_t::Format::kStandard)
    {
      frame_id = 
         bit::Value(0)
            .Insert(true,                      FrameIdentifier::kTransmitMailboxRequest)
            .Insert(message.is_remote_request, FrameIdentifier::kRemoteRequest)
            .Insert(Value(message.format),     FrameIdentifier::kIdentifierType)
            .Insert(message.id,                FrameIdentifier::kStandardIdentifier);

    }
    else if(message.format == Message_t::Format::kExtended)
    {
      frame_id = 
        bit::Value(0)
          .Insert(true,                      FrameIdentifier::kTransmitMailboxRequest)
          .Insert(message.is_remote_request, FrameIdentifier::kRemoteRequest)
          .Insert(Value(message.format),     FrameIdentifier::kIdentifierType)
          .Insert(message.id,                FrameIdentifier::kExtendedIdentifier);
    }         
    
    uint32_t data_a = 0;
    data_a |= message.payload[0] << (0 * 8);
    data_a |= message.payload[1] << (1 * 8);
    data_a |= message.payload[2] << (2 * 8);
    data_a |= message.payload[3] << (3 * 8);

    uint32_t data_b = 0;
    data_b |= message.payload[4] << (0 * 8);
    data_b |= message.payload[5] << (1 * 8);
    data_b |= message.payload[6] << (2 * 8);
    data_b |= message.payload[7] << (3 * 8);

    registers.frame  = frame_info;
    registers.id     = frame_id;
    registers.data_a = data_a;
    registers.data_b = data_b;

    
    return registers;
  }


  
  bool ConfigureFilter([[maybe_unused]] uint32_t id,
                        [[maybe_unused]] uint32_t mask,
                        [[maybe_unused]] bool is_extended = false)
                        {}
  void EnableAcceptanceFilter()
  {
    // (Dont think needed)
    // Configure Filters (8-9 as Mask Mode) (10 - 12 as List Mode)
    // 8 - 12 as 1 1100
    // CAN1->FM1R |= 0x1C << 8;              

    // Activate filter initialization mode (Set bit 0) 
    channel_.can->FMR  |=   0x1UL;
    SetFilterBankMode(FilterBankMode::kInitialization);
   
    // Deactivate filter 0 (Clear bit 0) 
    channel_.can->FA1R &= ~(0x1UL);
    ActivateFilter(Filter::k0, FilterActivation::kNotActive);    

    // Configure filter 0 to single 32-bit scale configuration (Set bit 0)
    channel_.can->FS1R |=   0x1UL;
    SetFilterScale(Filter::k0, FilterScale::kSingle32BitScale);             

    // Clear filters registers to 0
    channel_.can->sFilterRegister[0].FR1 = 0x0UL; 
    channel_.can->sFilterRegister[0].FR2 = 0x0UL;

    // Set filter to mask mode (Clear bit 0)
    channel_.can->FM1R &= ~(0x1UL);       
    SetFilterFilteringMode(Filter::k0, FilterMode::kMaskMode);      

