libhal/SJSU-Dev2/demos/stm32f10x/canbus/source/main.cpp
    // Assign filter 0 to FIFO 0 (Clear bit 0) 
    channel_.can->FFA1R &= ~(0x1UL);	
    SetFilterFIFOSelect(Filter::k0, FIFOSelect::kFIFO1);		   

    // Activate filter 0 (Set bit 0) 
    channel_.can->FA1R  |=   0x1UL;
    ActivateFilter(Filter::k0, FilterActivation::kActive);        

    // Deactivate filter initialization mode (clear bit 0)
    channel_.can->FMR   &= ~(0x1UL);
    SetFilterBankMode(FilterBankMode::kActive);	       
  }

  void SetFilterBankMode(FilterBankMode mode)
  {
     channel_.can->FMR =
        bit::Insert(channel_.can->FMR, Value(mode), FilterMaster::kInitializationMode);
  }

  void SetFilterFilteringMode(bit::Mask filter, FilterMode mode)
  {
    channel_.can->FM1R =
        bit::Insert(channel_.can->FM1R, Value(mode), filter);
  }

  void SetFilterScale(bit::Mask filter, FilterScale scale)
  {
    channel_.can->FS1R =
        bit::Insert(channel_.can->FS1R, Value(scale), filter);
  }

  void SetFilterFIFOSelect(bit::Mask filter, FIFOSelect fifo)
  {
    channel_.can->FFA1R =
        bit::Insert(channel_.can->FFA1R, Value(fifo), filter);
  }

  void ActivateFilter(bit::Mask filter, FilterActivation state)
  {
    channel_.can->FA1R =
        bit::Insert(channel_.can->FA1R, Value(state), filter);
  }

  /// Enable/Disable controller modes
  ///
  /// @param mode - which mode to enable/disable
  /// @param enable_mode - true if you want to enable the mode. False otherwise.
  void SetMode(bit::Mask mode, bool enable_mode) const
  {
    channel_.can->MCR =
        bit::Insert(channel_.can->MCR, enable_mode, mode);
  }

  void SetLoopback(bool enable_mode) const
  {
     channel_.can->BTR =
        bit::Insert(channel_.can->BTR, enable_mode, BusTiming::kLoopBackMode);
  }

    /// Verify controller modess
  bool VerifyStatus(bit::Mask status, bool state) const
  {
    return bit::Read(channel_.can->MSR, status);
  }
   const Port_t & channel_;
};

template <int port>
inline Can & GetCan()
{
  if constexpr (port == 1)
  {
    static auto & port1_transmit_pin = GetPin<'A', 12>();
    static auto & port1_read_pin     = GetPin<'A', 11>();

    /// Predefined definition for CAN1
    static const Can::Port_t kCan1 = {
      .td_pin           = port1_transmit_pin,
      .rd_pin           = port1_read_pin,
      .can              = stm32f10x::CAN1,
      .id               = sjsu::stm32f10x::SystemController::Peripherals::kCan1,
    };

    static Can can1(kCan1);
    return can1;
  }
  // else if constexpr (port == 2)
  // {
  //   static auto & port2_transmit_pin = GetPin<2, 8>();
  //   static auto & port2_read_pin     = GetPin<2, 7>();

  //   /// Predefined definition for CAN2
  //   static const Can::Port_t kCan2 = {
  //     .td_pin           = port2_transmit_pin,
  //     .td_function_code = 8,
  //     .rd_pin           = port2_read_pin,
  //     .rd_function_code = 2,
  //     .can        = stm32f10x::CAN2,
  //     .id               = sjsu::stm32f10x::SystemController::Peripherals::kCan2,
  //   };

  //   static Can can2(kCan2);
  //   return can2;
  // }
  else
  {
    static_assert(InvalidOption<port>,
                  SJ2_ERROR_MESSAGE_DECORATOR(
                      "Support CAN ports for LPC40xx are CAN1, CAN2"));
    return GetCan<0>();
  }
}
typedef struct
{
	uint16_t id;
	uint8_t  data[8];
	uint8_t  len;
} CAN_msg_t;

  void CANReceive(CAN_msg_t* CAN_rx_msg)
 {
	// Grab the identifier Bits 31:21
	CAN_rx_msg->id  = (stm32f10x::CAN1->sFIFOMailBox[0].RIR >> 21) & 0x7FFUL;
	// Grab the Data length Code
	CAN_rx_msg->len = (stm32f10x::CAN1->sFIFOMailBox[0].RDTR) & 0xFUL;
	
	CAN_rx_msg->data[0] = 0xFFUL &  stm32f10x::CAN1->sFIFOMailBox[0].RDLR;
	CAN_rx_msg->data[1] = 0xFFUL & (stm32f10x::CAN1->sFIFOMailBox[0].RDLR >> 8);
	CAN_rx_msg->data[2] = 0xFFUL & (stm32f10x::CAN1->sFIFOMailBox[0].RDLR >> 16);
	CAN_rx_msg->data[3] = 0xFFUL & (stm32f10x::CAN1->sFIFOMailBox[0].RDLR >> 24);
	CAN_rx_msg->data[4] = 0xFFUL &  stm32f10x::CAN1->sFIFOMailBox[0].RDHR;
	CAN_rx_msg->data[5] = 0xFFUL & (stm32f10x::CAN1->sFIFOMailBox[0].RDHR >> 8);
	CAN_rx_msg->data[6] = 0xFFUL & (stm32f10x::CAN1->sFIFOMailBox[0].RDHR >> 16);
	CAN_rx_msg->data[7] = 0xFFUL & (stm32f10x::CAN1->sFIFOMailBox[0].RDHR >> 24);
	
	stm32f10x::CAN1->RF0R |= 0x20UL;
 }

  uint8_t CANMsgAvail(void)
  {
    return CAN1->RF0R & 0x3UL;
  }

 }  // namespace stm32f10x
}  // namespace sjsu

int main(void)
{
  sjsu::stm32f10x::Can & can1 = sjsu::stm32f10x::GetCan<1>();
  
  sjsu::LogInfo("Initializing CAN 1 with default bit rate of 100 kBit/s...");
  can1.ModuleInitialize();
  
  using namespace sjsu;
  using namespace stm32f10x;
  CAN_msg_t CAN_rx_msg;  // Holds receiving CAN messages
  CAN_msg_t CAN_tx_msg;  // Holds transmitted CAN messagess
  int test_id = 0;

  while (true)
  { 
    sjsu::LogInfo("Sending Message with ID: %d", test_id);
    sjsu::Can::Message_t test_message;
    test_message.id = test_id;
    test_message.length = 8;
    test_message.payload[0] = 0x88 + test_id;
    test_message.payload[1] = 0x99 + test_id;
    test_message.payload[2] = 0xAA + test_id;
    test_message.payload[3] = 0xBB + test_id;
    test_message.payload[4] = 0xBB + test_id;
    test_message.payload[5] = 0xCC + test_id;
    test_message.payload[6] = 0xDD + test_id;
    test_message.payload[7] = 0xFF + test_id;
    can1.Send(test_message);

   
    // CAN_tx_msg.id      = 0;
    // CAN_tx_msg.data[0] = 0xAa;
    // CAN_tx_msg.data[1] = 0xBb;
    // CAN_tx_msg.data[2] = 0xCc;
    // CAN_tx_msg.data[3] = 0xDd;
    // CAN_tx_msg.data[4] = 0xEe;
    // CAN_tx_msg.data[5] = 0xFf;
    // CAN_tx_msg.data[6] = 0xAb;
    // CAN_tx_msg.data[7] = 0xAc;
    // CAN_tx_msg.len     = 8;

    // while(!(CAN1->sTxMailBox[0].TIR & 0x1UL))
    // {}
    // CAN1->sTxMailBox[0].TIR &= ~(0x1UL);

      // CANSend(&CAN_tx_msg);

      for (uint8_t i = 0; i < 20; i++)
      {
        sjsu::LogInfo("Waiting for message");
        sjsu::Delay(250ms);

        if(can1.HasData())
        {
          auto received_message = can1.Receive();
          sjsu::LogInfo("%d | %#04x %#04x %#04x %#04x %#04x %#04x %#04x %#04x\n",
                received_message.id,
                received_message.payload[0],
                received_message.payload[1],
                received_message.payload[2],
                received_message.payload[3],
                received_message.payload[4],
                received_message.payload[5],
                received_message.payload[6],
                received_message.payload[7]);
          // CANReceive(&CAN_rx_msg);
          // sjsu::LogInfo("%#04x %#04x %#04x %#04x %#04x %#04x %#04x %#04x\n",
          // CAN_rx_msg.data[0],
          // CAN_rx_msg.data[1],
          // CAN_rx_msg.data[2],
          // CAN_rx_msg.data[3],
          // CAN_rx_msg.data[4],
          // CAN_rx_msg.data[5],
          // CAN_rx_msg.data[6],
          // CAN_rx_msg.data[7]);
          break;
        }

      }
    test_id++;
    sjsu::Delay(1000ms);
  }

  return 0;
}


